In [6]:
import pandas as pd
import numpy as np

obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [7]:
obj2 = pd.Series([4, 7, -5, 3], index = ['d','b','a','c'])
obj2
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [8]:
obj2['a']
obj2['d'] = 6
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [9]:
obj2[obj2 > 0]
obj2*2
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [10]:
'b' in obj2
'e' in obj2

False

In [11]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000} #利用字典生成Series
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [12]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index = states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [13]:
pd.isnull(obj4)
pd.notnull(obj4)
obj4.isnull()
obj4.notnull()

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [14]:
obj3 + obj4 #自动对齐

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [15]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [16]:
obj
obj.index = ['Bob','Steve','Jeff','Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [17]:
obj.values
obj.index

Index(['Bob', 'Steve', 'Jeff', 'Ryan'], dtype='object')

In [18]:
import pandas as pd

data = {'state': ['ohio','Nevada','ohio'],
       'year': [2000,2001,2002,],
       'pop':[1.5, 1.7, 3.6]}
frame = pd.DataFrame(data)

pd.DataFrame(data,columns = ['year','state','pop'])

frame2 = pd.DataFrame(data,columns = ['year','state', 'pop', 'debt'],
                     index = ['one','two','three'])
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [19]:
import numpy as np

frame2.state
frame2['year']

frame2.loc['one']
frame2['debt'] = 16.5
frame2['debt'] = np.arange(3.)
frame2

       year   state  pop  debt
one    2000    ohio  1.5   0.0
two    2001  Nevada  1.7   1.0
three  2002    ohio  3.6   2.0

In [20]:
val = pd.Series([-1.2, -1.5, -1.7], index = ['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    ohio  1.5   NaN
two    2001  Nevada  1.7  -1.2
three  2002    ohio  3.6   NaN

In [21]:
frame2['eastern'] = frame2.state =='Oh io' #判断条件是state的列是否为Oh io,并且生成了新的列，而frame2.eastern无法生成新的列
frame2
del frame2['eastern']
frame2

       year   state  pop  debt
one    2000    ohio  1.5   NaN
two    2001  Nevada  1.7  -1.2
three  2002    ohio  3.6   NaN

In [22]:
pop = {'Nevada': {2001:2.4, 2002: 2.9}, 'Ohio': {2000:1.5,2001:1.7, 2002:3.6}}
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [23]:
frame3.T #进行转置
pd.DataFrame(pop, index = [2001, 2002,2003]) #index 可以是数字类型如int float

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [24]:
pdata = {'Ohio': frame3['Ohio'][:-1], 'Nevada':frame3['Nevada'][:2]} # -1代表删掉最后一个
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [25]:
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [26]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [27]:
# 索引对象
obj = pd.Series(range(3), index = ['a','b','c'])
index = obj.index
index
index[1:] 
#索引的对象无法改变
obj

a    0
b    1
c    2
dtype: int64

In [28]:
labels = pd.Index(np.arange(3))
labels
obj2 = pd.Series([1.5, -2.5, 0], index = labels)
obj2
obj2.index is labels

True

In [29]:
frame3
frame3.columns
'Ohio' in frame3.columns
2003 in frame3.index

False

In [30]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

In [31]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index = ['d','b','a','c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [32]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e']) #只是重新排序，并不会重新更改映射关系
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [33]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index = [0, 2, 4])
obj3
obj3.reindex(range(9), method = 'ffill') #会自动填充根据之前的index来产生数据填充比如0，2 都是blue， reindex后产生的0，1，2就都是blue

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
6    yellow
7    yellow
8    yellow
dtype: object

In [34]:
frame = pd.DataFrame(np.arange(9).reshape(3, 3),index = ['a','c','d'],columns = ['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [35]:
frame2 = frame.reindex(['a','b','c','d']) #改行
frame2

states = ['Texas', 'Utah', 'California']
frame3 = frame.reindex(columns = states)
frame3

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [36]:
frame4 = frame.loc[['a', 'e', 'c', 'd'], states] # 先行， 后列
frame4

C:\Users\90512\Anaconda3\Lib\site-packages\pandas\core\indexing.py:1494: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  return self._getitem_tuple(key)

   Texas  Utah  California
a    1.0   NaN         2.0
e    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [37]:
obj = pd.Series(np.arange(5.), index = ['a', 'b', 'c', 'd', 'e']) # arange(5.)里面的数据类型是float
obj
new_obj = obj.drop('c')
new_obj
obj.drop(['d','c']) #删除多行就用列表

a    0.0
b    1.0
e    4.0
dtype: float64

In [38]:
data = pd.DataFrame(np.arange(16).reshape(4,4), index = ['Ohio', 'Colorado', 'Utah', 'New York'], columns = ['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [39]:
data.drop(['Colorado','Ohio']) #删除某行
data.drop('two', axis = 1)
data.drop(['two','four'], axis = 'columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [40]:
obj.drop('c', inplace = True) # inplace代表会清除背删除的数据
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [41]:
obj = pd.Series(np.arange(4.), index = ['a','b','c','d'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [42]:
obj['b']
obj[1]
obj[2:4]
obj['c':'d']
obj[['b','a','d']]
obj[[1,3]]
obj[obj<2]

a    0.0
b    1.0
dtype: float64

In [43]:
obj['b':'c']
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [44]:
data = pd.DataFrame(np.arange(16).reshape(4,4), index = ['Ohio','colorado','Utah','New York'], columns = ['one', 'two','three','four'])

In [45]:
data

          one  two  three  four
Ohio        0    1      2     3
colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [46]:
data['two']

Ohio         1
colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [47]:
data[['two', 'three']]

          two  three
Ohio        1      2
colorado    5      6
Utah        9     10
New York   13     14

In [48]:
data[:2] #前两行
data[data['three']>5]

          one  two  three  four
colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [49]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [50]:
data[data<5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [52]:
data.loc['colorado',['two', 'three']] #直接取行列的名字

two      5
three    6
Name: colorado, dtype: int32

In [53]:
data.iloc[2,[3, 0, 1]] #index 为2的行，和index为3，0，1的列

four    11
one      8
two      9
Name: Utah, dtype: int32

In [54]:
data.iloc[[1,2],[3,0,1]]

          four  one  two
colorado     7    0    5
Utah        11    8    9

In [62]:
data.loc[:'Utah','two']
data.iloc[:,:2]

          one  two
Ohio        0    0
colorado    0    5
Utah        8    9
New York   12   13

In [65]:
ser = pd.Series(np.arange(3.))
ser
ser[-1]

KeyError: -1

In [68]:
ser2 = pd.Series(np.arange(3.), index = ['a', 'b', 'c'])
print(ser2)
ser2[-1] #最后一个

a    0.0
b    1.0
c    2.0
dtype: float64

2.0

In [73]:
print(ser[:1])

print(ser.loc[:1]) # 用于标签
ser.iloc[:1]#用于整数

0    0.0
dtype: float64
0    0.0
1    1.0
dtype: float64

0    0.0
dtype: float64

In [76]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index = ['a', 'c', 'd','e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],index = ['a', 'c','e','f','g'])
print(s1)
print(s2)
s1+s2

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64
a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [80]:
df1 = pd.DataFrame(np.arange(9.).reshape(3,3), columns = list('bcd'), index = ['Ohio','Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape(4,3), columns = list('bde'),index = ['Utah','Ohio','Texas','Oregon'])
df1
print(df1+df2)

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [83]:
df1 = pd.DataFrame(np.arange(12.).reshape(3,4),columns = list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape(4,5),columns = list('abcde'))
print(df1)
print(df2)
df2.loc[1,'b'] =np.nan
df2
df1+df2

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0
      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [84]:
df1.add(df2, fill_value = 0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [86]:
1/df1
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [87]:
df1.reindex(columns = df2.columns, fill_value = 0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [92]:
arr = np.arange(12.).reshape((3,4))
arr
arr[0] #第1行
arr - arr[0] #在每一行都进行了操作，广播机制

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [108]:
frame = pd.DataFrame(np.arange(12.).reshape(4,3),columns =list('bde'),index = ['Utah','Ohio','Texas','Oregon'])
series = frame.iloc[0]
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [104]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [107]:
series2 = pd.Series(range(3), index = ['b','e','f'])
print(series2)
frame + series2

b    0
e    1
f    2
dtype: int64

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [114]:
series3 = frame['d']
frame
series3
frame.sub(series3, axis ='index') #在列上进行广播用sub，在行上匹配、

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [128]:
frame = pd.DataFrame(np.random.randn(4,3), columns = list('bde'), index = ['Utah','Ohio','Texas','Oregon'])
print(frame)
np.abs(frame)
frame

               b         d         e
Utah    0.405924  0.003202 -0.185592
Ohio    0.552987 -0.788497 -0.806247
Texas  -0.248468 -1.246923 -1.601237
Oregon  0.135323  2.372184  1.271881

               b         d         e
Utah    0.405924  0.003202 -0.185592
Ohio    0.552987 -0.788497 -0.806247
Texas  -0.248468 -1.246923 -1.601237
Oregon  0.135323  2.372184  1.271881

In [129]:
f = lambda x:x.max()-x.min()
print(frame.apply(f))
frame.apply(f, axis = 'columns')

b    0.801455
d    3.619108
e    2.873118
dtype: float64

Utah      0.591516
Ohio      1.359234
Texas     1.352769
Oregon    2.236862
dtype: float64

In [131]:
def f(x):
    return pd.Series([x.min(), x.max()],index = ['min','max'])
frame.apply(f)

            b         d         e
min -0.248468 -1.246923 -1.601237
max  0.552987  2.372184  1.271881

In [133]:
format = lambda x: '%.2f' % x
frame.applymap(format)
frame['e'].map(format)

Utah      -0.19
Ohio      -0.81
Texas     -1.60
Oregon     1.27
Name: e, dtype: object

In [134]:
obj = pd.Series(range(4), index = ['d','a','b','c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [143]:
frame = pd.DataFrame(np.arange(8).reshape((2,4)), index = ['three','one'],columns = ['d','a','b','c'])
frame
frame.sort_index()#本题根据字母顺序来排序
frame.sort_index(axis = 1)#对列名进行sort排序

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [144]:
frame.sort_index(axis = 1, ascending = False)#下降

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [145]:
obj = pd.Series([4,7,-3,2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [146]:
obj = pd.Series([4,np.nan,7,np.nan,-3,2])
obj.sort_values() #Nan总是在最后

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [150]:
frame = pd.DataFrame({'b':[4,7,-3,2],'a':[0,1,0,1]})
frame
frame.sort_values(by = 'b', ascending = False) #根据b列进行从小到大排序

   b  a
1  7  1
0  4  0
3  2  1
2 -3  0

In [151]:
frame.sort_values(by = ['a','b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [152]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj.rank() #返回的是排名值，如果有两个或者多个相同数字，那么取两个位数的平均值

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [153]:
obj.rank(method = 'first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [157]:
obj.rank(ascending = True, method = 'min') #method是说碰到相同数是选用最小，还是最大，或者按照index来排序

0    6.0
1    1.0
2    6.0
3    4.0
4    3.0
5    2.0
6    4.0
dtype: float64

In [161]:
frame = pd.DataFrame({'b':[4.3,7,-3,2],'a':[0,1,0,1],'c':[-2,5,8,-2.5]})
frame.rank(axis= 'columns') #按列的大小来比较，按行来算

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [163]:
obj = pd.Series(range(5), index = ['a','a','b','b','c'])
obj
obj.index.is_unique

False

In [165]:
obj['a']
obj['c']

4

In [167]:
df = pd.DataFrame(np.random.randn(4,3), index = ['a','a','b','b'])
print(df)
df.loc['b']

          0         1         2
a  2.280482 -1.007698 -0.661799
a  1.299395  0.317962  0.571975
b -1.192834 -1.119666 -0.093840
b -0.097170  0.006700  0.397530

          0         1        2
b -1.192834 -1.119666 -0.09384
b -0.097170  0.006700  0.39753